### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-16T22:21:51.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:31",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:27" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:27/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip" -> "lambda-builds/116b1860c740dbd84571be19388fefe3e2bd370ea692134c022e925372d3beac.zip"
!       s3_object_version              = "8FIpaKkiTVGj1xydbizdzB1Nq2FFSxMG" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "27" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "cataprato-auth-lambda"
+       id                  = (known after apply)
+       principal           = "apigateway.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8/*/*"
+       statement_id        = "APIGatewayAny"
+       statement_id_prefix = (known after apply)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "cataprato-auth-20230809133507800000000001"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "lambda-builds/116b1860c740dbd84571be19388fefe3e2bd370ea692134c022e925372d3beac.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "./.terraform/lambda-builds/116b1860c740dbd84571be19388fefe3e2bd370ea692134c022e925372d3beac.zip"
+       storage_class          = "ONEZONE_IA"
+       tags                   = {
+           "Deployment" = "terraform"
        }
+       tags_all               = {
+           "Deployment" = "terraform"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "!src/.*",
                        ],
                    ],
+                   [
+                       "zip",
+                       ".",
+                       "app",
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/116b1860c740dbd84571be19388fefe3e2bd370ea692134c022e925372d3beac.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/116b1860c740dbd84571be19388fefe3e2bd370ea692134c022e925372d3beac.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2866290589750427388" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip" -> "./.terraform/lambda-builds/116b1860c740dbd84571be19388fefe3e2bd370ea692134c022e925372d3beac.zip"
!           "timestamp" = "1692224435383558000" -> "1692230968044150200"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "88749772837520399" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip" -> "./.terraform/lambda-builds/116b1860c740dbd84571be19388fefe3e2bd370ea692134c022e925372d3beac.zip"
!           "original_source_code" = jsonencode(
!               [
!                   {
!                       path          = "./src" -> "."
+                       prefix_in_zip = "app"
                        # (1 unchanged attribute hidden)
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] will be created
+   resource "aws_lambda_layer_version" "this" {
+       arn                         = (known after apply)
+       compatible_runtimes         = [
+           "python3.10",
        ]
+       created_date                = (known after apply)
+       description                 = "Pip layer"
+       id                          = (known after apply)
+       layer_arn                   = (known after apply)
+       layer_name                  = "cataprato-auth-layer-s3"
+       s3_bucket                   = "cataprato-auth-20230809133507800000000001"
+       s3_key                      = "builds/3dc833633beecaa70c57ae307f0d43d8f0ba51a177e1ceb80e9f28369f2c0cf9.zip"
+       s3_object_version           = (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
+       skip_destroy                = false
+       source_code_hash            = (known after apply)
+       source_code_size            = (known after apply)
+       version                     = (known after apply)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "cataprato-auth-20230809133507800000000001"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/3dc833633beecaa70c57ae307f0d43d8f0ba51a177e1ceb80e9f28369f2c0cf9.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "builds/3dc833633beecaa70c57ae307f0d43d8f0ba51a177e1ceb80e9f28369f2c0cf9.zip"
+       storage_class          = "ONEZONE_IA"
+       tags                   = {
+           "Deployment" = "terraform"
        }
+       tags_all               = {
+           "Deployment" = "terraform"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/3dc833633beecaa70c57ae307f0d43d8f0ba51a177e1ceb80e9f28369f2c0cf9.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/3dc833633beecaa70c57ae307f0d43d8f0ba51a177e1ceb80e9f28369f2c0cf9.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "6841579512417492042" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/a71b09ddf6bbcea41a40d39d4c1a4b2e6583c49adb8cb15e3f49eccf1b70f879.zip" -> "builds/3dc833633beecaa70c57ae307f0d43d8f0ba51a177e1ceb80e9f28369f2c0cf9.zip"
!           "timestamp" = "1692224437098037000" -> "1692230950982759000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "5311609634391794698" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/a71b09ddf6bbcea41a40d39d4c1a4b2e6583c49adb8cb15e3f49eccf1b70f879.zip" -> "builds/3dc833633beecaa70c57ae307f0d43d8f0ba51a177e1ceb80e9f28369f2c0cf9.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 4 to destroy.
```
</details>